Repository: Ejmen-Ramic/my-website
Catalog: src/locales/ba/messages.po
Languages: bs

source: • Creating and maintaining automated test scripts<0/>• Front and Backend development of the website<1/>• Database design, modeling, data import and migration
bs: • Kreiranje i održavanje automatizovanih test skripti<0/>• Frontend i Backend razvoj web stranice<1/>• Dizajn baze podataka, modeliranje, unos podataka i migracija

source: • Maintain the company's website, design, and create new content<0/> • Handling customers and providing the best packages and locations based on the requirements set out by them in the Maldives<1/> • Creating invoices for the customers<2/> • Successfully connected luxury hotels in Bosnia & Herzegovina with IMTM to create affordable tourist packages for Maldivians to experience the Balkan region especially during the winter season
bs: • Održavanje web stranice kompanije, dizajniranje i kreiranje novog sadržaja<0/> • Rad sa klijentima i pružanje najboljih paketa i lokacija prema njihovim zahtjevima na Maldivima<1/> • Kreiranje faktura za klijente<2/> • Uspješno povezivanje luksuznih hotela u Bosni i Hercegovini sa IMTM-om kako bi se kreirali pristupačni turistički paketi za Maldivce da dožive balkansku regiju, posebno tokom zimske sezone

source: <0>•</0> With over <1>4 years</1> of experience in software development, I specialize in building scalable <2>web applications</2> and <3>microservices</3>. I'm passionate about clean code, performance optimization, and creating exceptional user experiences.<4/><5/><6>•</6> Currently I work as a <7>QA</7> & <8>FullStack Engineer</8> at <9>FLUX</9> Malaysia. I cover most of the production development of the website. From <10>managing</10> the QA team to developing new features and optimizing the performance of the website.
bs: <0>•</0> Sa više od <1>4 godine</1> iskustva u razvoju softvera, specijalizovan sam za izgradnju skalabilnih <2>web aplikacija</2> i <3>mikroservisa</3>. Strastven sam u vezi sa čistim kodom, optimizacijom performansi i stvaranjem izuzetnih korisničkih iskustava.<4/><5/><6>•</6> Trenutno radim kao <7>QA</7> i <8>FullStack inženjer</8> u kompaniji <9>FLUX</9> Malezija. Pokrivam većinu razvoja produkcijskog sajta, uključujući <10>upravljanje</10> QA timom, razvoj novih funkcionalnosti i optimizaciju performansi sajta.

source: <0>•</0><1><2> Adobe Photoshop: </2></1>Creates custom assets, icons, and graphics for web interfaces.<3/><4/><5>•</5><6><7> Adobe Premiere: </7></6> Edits promotional videos or UI demonstration clips for apps.<8/><9/><10>•</10><11><12> Adobe Lightroom: </12></11> Enhances photos for web content or marketing visuals.<13/><14/><15>•</15><16><17> Figma: </17></16> Designs wireframe, prototypes, and collaborative UI/UX workflows for web apps.
bs: <0>•</0><1><2> Adobe Photoshop: </2></1> Kreira prilagođene asete, ikone i grafike za web interfejse.<3/><4/><5>•</5><6><7> Adobe Premiere: </7></6> Montira promotivne video zapise ili demonstracione klipove za aplikacije.<8/><9/><10>•</10><11><12> Adobe Lightroom: </12></11> Poboljšava fotografije za web sadržaj ili marketinške vizuale.<13/><14/><15>•</15><16><17> Figma: </17></16> Dizajnira wireframe-ove, prototipe i kolaborativne UI/UX tokove rada za web aplikacije.

source: <0>•</0><1><2> Chakra UI: </2></1>Provides pre-built, accessible UI components and theming capabilities for rapid development. Used to create consistent and polished designs.<3/><4/><5>•</5><6><7> ShadCN UI: </7></6>A customizable design system built with Tailwind CSS, ideal for modern web app interfaces.<8/><9/><10>•</10><11><12> Tailwind CSS: </12></11>Utility-first CSS framework for building responsive layouts and customizing UI components with minimal effort.<13/><14/><15>•</15><16><17> Framer Motion: </17></16>Adds smooth animations and transitions to web applications, improving user experience and interactivity.
bs: <0>•</0><1><2> Chakra UI: </2></1> Obezbeđuje unapred pripremljene, pristupačne UI komponente i mogućnosti tematskog prilagođavanja za brzi razvoj. Koristi se za kreiranje doslednih i uglađenih dizajna.<3/><4/><5>•</5><6><7> ShadCN UI: </7></6> Prilagodljiv dizajn sistem izgrađen uz Tailwind CSS, idealan za moderne interfejse web aplikacija.<8/><9/><10>•</10><11><12> Tailwind CSS: </12></11> CSS framework zasnovan na korisnim klasama za izgradnju responzivnih rasporeda i prilagođavanje UI komponenti sa minimalnim naporom.<13/><14/><15>•</15><16><17> Framer Motion: </17></16> Dodaje glatke animacije i tranzicije web aplikacijama, poboljšavajući korisničko iskustvo i interaktivnost.

source: <0>•</0><1><2> Git: </2></1> Version control for managing codebase changes and collaboration among teams.<3/><4/><5>•</5><6><7> Jest: </7></6>Framework for unit testing, ensuring the reliability of code logic.<8/><9/><10>•</10><11><12> Cypress: </12> </11>End-to-end testing for user flows and UI interactions.<13/><14/><15>•</15><16><17> Playwright: </17></16> Automated testing across browsers for consistent app behavior.<18/><19/><20>•</20><21><22> Jira: </22></21> Tracks project tasks, bugs, and progress in development workflows.<23/><24/><25>•</25><26><27> Trello: </27></26>Manages development tasks and organizes sprints visually.<28/><29/><30>•</30><31><32> Notion: </32></31> Documents and collaborates on web app development processes.<33/><34/><35>•</35><36><37> Slack: </37></36> Facilitates team communication and integrations with development tools.<38/><39/>
bs: <0>•</0><1><2> Git: </2></1> Verzijska kontrola za upravljanje promenama u kodnoj bazi i saradnju među timovima.<3/><4/><5>•</5><6><7> Jest: </7></6> Framework za jedinično testiranje, osiguravajući pouzdanost logike koda.<8/><9/><10>•</10><11><12> Cypress: </12> </11> Testiranje od kraja do kraja za korisničke tokove i interakcije sa UI.<13/><14/><15>•</15><16><17> Playwright: </17></16> Automatizovano testiranje u različitim pretraživačima za dosledno ponašanje aplikacija.<18/><19/><20>•</20><21><22> Jira: </22></21> Prati zadatke projekta, greške i napredak u razvojnim tokovima.<23/><24/><25>•</25><26><27> Trello: </27></26> Upravljanje razvojnim zadacima i organizacija sprintova vizualno.<28/><29/><30>•</30><31><32> Notion: </32></31> Dokumentovanje i saradnja na procesima razvoja web aplikacija.<33/><34/><35>•</35><36><37> Slack: </37></36> Omogućava timsku komunikaciju i integracije sa alatima za razvoj.<38/><39/>

source: <0>•</0><1><2> MongoDB: </2></1> NoSQL database for flexible, schema-less storage of application data, ideal for real-time apps.<3/><4/><5>•</5><6><7> MySQL: </7></6> Relational database used for structured data and complex queries in web applications.<8/><9/><10>•</10><11><12> Prisma: </12></11> Simplifies database access and management with an ORM tailored for modern TypeScript-based applications.
bs: <0>•</0><1><2> MongoDB: </2></1> NoSQL baza podataka za fleksibilno skladištenje podataka bez šeme, idealna za aplikacije u realnom vremenu.<3/><4/><5>•</5><6><7> MySQL: </7></6> Relaciona baza podataka koja se koristi za strukturisane podatke i složene upite u web aplikacijama.<8/><9/><10>•</10><11><12> Prisma: </12></11> Pojednostavljuje pristup i upravljanje bazama podataka sa ORM-om prilagođenim modernim TypeScript aplikacijama.

source: <0>•</0><1><2> React: </2></1>Builds interactive, component-based UIs efficiently with reusable logic. Core to creating dynamic web applications.<3/><4/><5>•</5><6><7> Node.js: </7></6>Handles server-side logic, RESTful APIs, and real-time functionalities in web applications.<8/><9/><10>•</10><11><12> WordPress: </12></11>Useful for creating CMS-driven web apps with custom themes and plugins.<13/><14/><15>•</15><16><17> Next.js: </17></16>Extends React with server-side rendering (SSR), static site generation (SSG), and API routes for performance and SEO optimization.
bs: <0>•</0><1><2> React: </2></1> Gradi interaktivne, komponente bazirane UI na efikasan način sa mogućnošću ponovne upotrebe logike. Ključno za kreiranje dinamičkih web aplikacija.<3/><4/><5>•</5><6><7> Node.js: </7></6> Obrađuje logiku na serverskoj strani, RESTful API-je i funkcionalnosti u realnom vremenu za web aplikacije.<8/><9/><10>•</10><11><12> WordPress: </12></11> Koristan za kreiranje CMS-driven web aplikacija sa prilagođenim temama i pluginovima.<13/><14/><15>•</15><16><17> Next.js: </17></16> Proširuje React sa server-side rendering (SSR), generacijom statičkih sajtova (SSG) i API rutama za optimizaciju performansi i SEO.

source: <0>•</0><1><2> TypeScript: </2></1>Enhances JavaScript with static typing, ensuring better maintainability and catching bugs early during development. Commonly used with React and Next.js for creating scalable web apps.<3/><4/><5>•</5><6><7> JavaScript: </7></6>Core language for implementing interactivity, handling user events, and integrating APIs in web apps.<8/><9/><10>•</10><11><12> CSS: </12></11>Used to style components and ensure responsive, visually appealing user interfaces.
bs: <0>•</0><1><2> TypeScript: </2></1> Poboljšava JavaScript sa statičkom tipizacijom, osiguravajući bolju održivost i rano otkrivanje grešaka tokom razvoja. Uobičajeno se koristi sa React i Next.js za kreiranje skalabilnih web aplikacija.<3/><4/><5>•</5><6><7> JavaScript: </7></6> Osnovni jezik za implementaciju interaktivnosti, rukovanje korisničkim događajima i integraciju API-ja u web aplikacijama.<8/><9/><10>•</10><11><12> CSS: </12></11> Koristi se za stilizovanje komponenti i osiguravanje responzivnih, vizuelno privlačnih korisničkih interfejsa.

source: <0>•</0>Cumulative Grade Point's Average(CGPA): 3.44/4.0<1/><2>•</2>The Dean's List for academic excellence in <3>Semester2, 2019/2020 </3> Session<4/><5>•</5>The Dean's List for academic excellence in <6>Semester2, 2020/2021 </6>Session<7/><8>•</8>Final Year Project (FYP) promising projects 2021 (System Development Category)
bs: <0>•</0>Prosječni zbir ocjena (CGPA): 3.44/4.0<1/><2>•</2>Lista dekana za akademsku izvrsnost u <3>2. semestru, 2019/2020 </3> akademskoj godini<4/><5>•</5>Lista dekana za akademsku izvrsnost u <6>2. semestru, 2020/2021 </6>akademskoj godini<7/><8>•</8>Završni projekt (FYP) perspektivni projekti 2021 (Kategorija razvoja sistema)

source: 1. Tell me about yourself.
bs: 1. Recite mi nešto o sebi.

source: 10. What do you like to do on your free time?
bs: 10. Šta voliš da radiš u slobodno vreme?

source: 2. What are your greatest strengths and weaknesses?
bs: 2. Koje su vaše najveće snage i slabosti?

source: 3. Where do you see yourself in five years?
bs: 3. Gdje se vidite za pet godina?

source: 4. Describe a challenging situation at work and how you handled it?
bs: 4. Opišite izazovnu situaciju na poslu i kako ste je riješili?

source: 5. Give me an example of a time when you worked as part of a team.
bs: 5. Dajte mi primjer kada ste radili kao dio tima.

source: 6. Tell me about a time when you had to learn something new quickly.
bs: 6. Recite mi o vremenu kada ste morali brzo naučiti nešto novo.

source: 7. How do you prioritize your tasks when you have multiple deadlines?
bs: 7. Kako prioritizirate svoje zadatke kada imate više rokova?

source: 8. A time when you optimized an application for better performance.
bs: 8. Vrijeme kada ste optimizirali aplikaciju za bolje performanse.

source: 9. Can you walk me through a project you worked on?
bs: 9. Možete li me provesti kroz projekt na kojem ste radili?

source: About Me
bs: O meni

source: Admin Dashboard Development
bs: Razvoj administratorske kontrolne table

source: All rights reserved
bs: Sva prava zadržana

source: All rights reserved.
bs: Sva prava zadržana.

source: An error occurred while subscribing.
bs: Došlo je do greške prilikom pretplate.

source: April 15, 2022 - January 15, 2023
bs: 15. april 2022 - 15. Januar 2023

source: April, 2022 - January, 2023
bs: April, 2022 - Januar 2023

source: As a young adult, growing up in a beautiful city of Bosnia and Herzegovina, I always admired the great developers who managed to make something new from an empty page whether its a computer software or a basic web page. Bosnia, at the time was not well developed so I had to pursue my studies in Malaysia as a software engineer. Further down the road I have found my interest in software engineering. Whether its difficult or not, my passion grew. I have met many people who shared the same interest as me and together we improved not just in coding but also problem solving. This website is a showcase of my journey and projects that I have undertaken so far.
bs: Kao mlada osoba, odrastajući u prelepom gradu Bosne i Hercegovine, oduvek sam se divio sjajnim programerima koji su uspeli da stvore nešto novo iz prazne stranice, bilo da je to računalni softver ili osnovna web stranica. Bosna, u to vreme, nije bila dobro razvijena, pa sam morao nastaviti studije u Maleziji kao softverski inženjer. Dalje tokom puta, pronašao sam interesovanje u softverskom inženjerstvu. Bez obzira na to da li je teško ili ne, moja strast je rasla. Upoznao sam mnoge ljude koji su delili iste interese kao ja i zajedno smo napredovali ne samo u kodiranju, već i u rešavanju problema. Ova web stranica je prikaz mog putovanja i projekata koje sam do sada preuzeo.

source: Bachelor's Degree
bs: Diploma prvog ciklusa studija

source: Bachelor's in Information and Communication Technology
bs: Diplomirani inženjer informacijskih i komunikacijskih tehnologija

source: Bosnian
bs: Bosanski

source: Bosnian Version
bs: Bosanska verzija

source: Chief Technology Officer at Sense Malaysia
bs: Glavni tehnički direktor u Sense Malaysia

source: Co-founder of AfterFund USA
bs: Suosnivač AfterFund USA

source: Coding
bs: Kodiranje

source: Connection Error
bs: Greška u vezi

source: Contact
bs: Kontakt

source: Contacts
bs: Kontakti

source: Copyright
bs: Autorsko pravo

source: Crypto Charity
bs: Kripto dobrotvorna organizacija

source: Databases
bs: Datoteke

source: Deans List
bs: Dekanova Lista

source: Design Projects 1
bs: Dizajnerski Projekti 1

source: Design Projects 2
bs: Dizajnerski Projekti 2

source: Design Projects 3
bs: Dizajnerski Projekti 3

source: During my time at FLUX, I had the opportunity to dive into the world of frontend web development. Working hands-on with Chakra UI, TypeScript, React, Next.js, JavaScript, and CSS, I contributed to several projects, learning and growing every step of the way. It was an invaluable experience that helped me refine my skills and solidify my passion for creating dynamic and user-friendly web applications.
bs: Tokom mog vremena u FLUX-u, imao sam priliku da se upustim u svet frontend web razvoja. Radeći direktno sa Chakra UI, TypeScript-om, React-om, Next.js-om, JavaScript-om i CSS-om, doprineo sam nekoliko projekata, učeći i napredujući na svakom koraku. Bilo je to neprocenjivo iskustvo koje mi je pomoglo da usavršim svoje veštine i učvrstim svoju strast za kreiranjem dinamičnih i korisnički prijatnih web aplikacija.

source: Education
bs: Edukacija

source: Ejmen brings a rare mix of technical expertise and innovative thinking. His approach to software engineering reflects a deep understanding of modern development practices, paired with a unique ability to simplify complex problems. He's a true asset to any team.
bs: Ejmen donosi rijetku kombinaciju tehničke stručnosti i inovativnog razmišljanja. Njegov pristup softverskom inženjeringu odražava duboko razumijevanje modernih razvojnih praksi, uz jedinstvenu sposobnost pojednostavljivanja složenih problema. On je pravi resurs za svaki tim.

source: Ejmen brings a rare mix of technical expertise and innovative thinking. His approach to software engineering...
bs: Ejmen donosi rijetku kombinaciju tehničke stručnosti i inovativnog razmišljanja. Njegov pristup softverskom inženjeringu...

source: Ejmen is a diligent and gifted coder, but what stuck out to me is his integrity. I've seen him operate in several contexts. In each case, he demonstrated incredible character and professionalism. Especially if you're not in the IT field yourself and not sure how things work, having someone who you can trust to do things right--and do right by you--is invaluable. I recommend him without reservation.
bs: Ejmen je marljiv i talentiran programer, ali ono što mi je posebno zapalo za oko je njegov integritet. Vidio sam ga kako djeluje u nekoliko konteksta. U svakom slučaju, pokazao je nevjerojatne karakteristike i profesionalizam. Posebno ako niste iz IT industrije i niste sigurni kako stvari funkcionišu, imati nekog kome možete vjerovati da će stvari napraviti ispravno – i učiniti ispravno prema vama – neprocjenjivo je. Preporučujem ga bez ikakvih rezervi.

source: Ejmen is a diligent and gifted coder, but what stuck out to me is his integrity. I've seen him operate in several...
bs: Ejmen je marljiv i talentiran programer, ali ono što mi je posebno zapalo za oko je njegov integritet. Vidio sam ga kako djeluje u nekoliko...

source: Ejmen's ability to identify, analyze, and resolve issues efficiently is remarkable. Whether it's backend optimization or...
bs: Ejmenova sposobnost prepoznavanja, analize i efikasnog rješavanja problema je izvanredna. Bilo da se radi o optimizaciji backend-a ili...

source: Email address
bs: Email adresa

source: Endorsement
bs: Preporuka

source: Engaged in a valuable internship experience as a Web Coordinator at International Maldives Travel Market (IMTM), where I gained practical skills and insights into Travel and Tourism.
bs: Učestvovao sam u vrednom iskustvu prakse kao web koordinator na International Maldives Travel Market (IMTM), gde sam stekao praktične veštine i uvide u putovanja i turizam.

source: English
bs: Engleski

source: English Version
bs: Engleska Verzija

source: Enter your email
bs: Vaša email adresa

source: Explore <0>my</0><1/>limitless possibilities
bs: Istražite <0>moje</0><1/>neograničene mogućnosti

source: Explore my proficiency in web development tools, programming languages, QA testing frameworks, and MongoDB database management.
bs: Istražite moje vještine u alatima za razvoj weba, programskim jezicima, QA okvirima za testiranje i upravljanju MongoDB bazom podataka.

source: Extra Curriculum
bs: Vanredne aktivnosti

source: Fast development
bs: Brz razvoj

source: Featured Projects
bs: Istaknuti projekti

source: features
bs: značajke

source: February 2, 2018
bs: 2. Februar 2018.

source: February, 2023 - Present
bs: Februar, 2023 - Sada

source: Final Year Project
bs: Završni Projekat Godine

source: Fluent
bs: Tečno

source: FLUX, Malaysia
bs: FLUX, Malezija

source: Forgot password?
bs: Zaboravili ste lozinku?

source: Forgot your password?
bs: Zaboravili ste lozinku?

source: Frameworks
bs: Framework

source: Frequently Asked Questions
bs: Često postavljana pitanja

source: German
bs: Njemački

source: Graphic Design
bs: Grafički Dizajn

source: Graphics Design
bs: Grafički Dizajn

source: Guaranteed Quality
bs: Zajamčena kvaliteta

source: Head of Engineering at Flux Malaysia
bs: Šef inženjeringa u Flux Malaysia

source: Hi. My name is Ejmen. I'm a software engineer from Bosnia and Herzegovina, and this is my web resume. Here, you can see my capabilities and skills as a software engineer and as a photographer. Feel free to explore my website and my photo gallery.
bs: Zdravo. Moje ime je Ejmen. Ja sam softverski inženjer iz Bosne i Hercegovine, i ovo je moj online rezime. Ovdje možete vidjeti moje sposobnosti i vještine kao softverskog inženjera i fotografa. Slobodno istražite moju web stranicu i galeriju fotografija.

source: Highly Experienced
bs: Visoko Iskusan

source: Hobbies
bs: Hobiji

source: Home
bs: Početna

source: I
bs: Ja

source: I am a <0>software developer</0> with a passion for creating <1>intuitive</1> and <2>efficient user experiences</2>. I have been working with <3>latest languages, frameworks and testing tools</3> for the past few years, and I love how these tools enable me to build <4>scalable</4> and <5>maintainable</5> applications.<6/><7/> Outside of work, I enjoy hiking and exploring new places, which helps me stay creative and refreshed.
bs: Ja sam <0>softverski developer</0> s velikom strašću za kreiranje <1>intuitivnih</1> i <2>efikasnih korisničkih iskustava</2>. Posljednjih nekoliko godina radim s <3>najnovijim jezicima, okvirima i alatima za testiranje</3>, i volim kako mi ovi alati omogućavaju da gradim <4>skalabilne</4> i <5>održive</5> aplikacije.<6/><7/> Izvan posla, uživam u planinarenju i istraživanju novih mjesta, što mi pomaže da ostanem kreativan i osvježen.

source: I have developed my skills through sheer dedication and hard work, investing countless hours into coding and collaborating closely with the product team.
bs: Razvio sam svoje vještine zahvaljujući velikoj posvećenosti i napornom radu, ulažući nebrojene sate u kodiranje i blisku saradnju s proizvodnim timom.

source: I love <0>hiking</0>, <1>exploring</1> new places and <2>photographing</2> landscapes, which helps me stay <3>creative</3> and refreshed. I also enjoy working on side projects that involve <4>engineering</4>.
bs: Volim <0>planinarenje</0>, <1>istraživanje</1> novih mjesta i <2>fotografisanje</2> pejzaža, što mi pomaže da ostanem <3>kreativan</3> i osvježen. Također uživam raditi na dodatnim projektima koji uključuju <4>inženjering</4>.

source: I love running.
bs: Volim trčanje.

source: I take pride in crafting clean, readable code while bringing a passion for problem-solving and a commitment to continuous growth. My experience working with diverse teams has honed my communication and interpersonal skills, fostering a collaborative environment that drives creativity and innovation. With a proven ability to meet tight deadlines without compromising quality, I approach every challenge with a proactive mindset and a dedication to excellence, ready to make meaningful contributions to any team or project.
bs: Ponosim se pisanjem čistog i čitljivog koda, dok donosim strast prema rješavanju problema i posvećenost kontinuiranom razvoju. Moje iskustvo rada s raznolikim timovima izbrusilo je moje komunikacijske i interpersonalne vještine, potičući saradničku atmosferu koja podstiče kreativnost i inovaciju. S dokazanim sposobnostima ispunjavanja kratkih rokova bez kompromitovanja kvaliteta, svakom izazovu pristupam s proaktivnim načinom razmišljanja i posvećenošću izvrsnosti, spreman dati značajan doprinos svakom timu ili projektu.

source: I thrive in collaborative environments, where I can learn, grow, and exchange experiences with others. I firmly believe that with teamwork, any project can be accomplished.
bs: Uspijevam u suradničkim okruženjima, gdje mogu učiti, rasti i razmjenjivati iskustva s drugima. Čvrsto vjerujem da se s timskim radom svaki projekt može ostvariti.

source: I use a combination of prioritization techniques like the <0>Eisenhower Matrix</0> to categorize tasks by urgency and importance. I also break down larger tasks into smaller, manageable chunks and use tools like <1>Trello</1> or <2>Notion</2> to keep track of progress. This helps me <3>stay organized</3> and ensures that I focus on the most critical tasks first.
bs: Koristim kombinaciju tehnika prioritizacije poput <0>Eisenhowerove matrice</0> za kategorizaciju zadataka prema hitnosti i važnosti. Također razlažem veće zadatke na manje, upravljive dijelove i koristim alate poput <1>Trella</1> ili <2>Notiona</2> za praćenje napretka. Ovo mi pomaže da <3>ostanem organiziran</3> i osigurava da se fokusiram na najkritičnije zadatke prvo.
