Repository: Ejmen-Ramic/my-website
Catalog: src/locales/ba/messages.po
Languages: bs

source: I worked on a project called Project V4, where my role as a software engineer involved converting and rewriting old JavaScript code and outdated packages into the latest TypeScript, React, Chakra UI and improved server side rendering of Next.js. I managed this project alongside one colleague, and together we completed it within three months. The project was a success, requiring us to write thousands of lines of code to achieve our goals. Currently FLUX website is the fastest in Asia.
bs: Radio na projektu nazvanom Projekt V4, gde je moja uloga kao softverskog inženjera uključivala konvertovanje i prepravku starog JavaScript koda i zastarelih paketa u najnoviji TypeScript, React, Chakra UI i poboljšanje server-side renderinga Next.js. Upravljao sam ovim projektom zajedno s jednim kolegom, i zajedno smo ga završili u roku od tri meseca. Projekat je bio uspešan, zahtevajući da napišemo hiljade linija koda kako bismo postigli naše ciljeve. Trenutno je FLUX-ov web sajt najbrži u Aziji.

source: I worked on a project where we had to develop a <0>complex admin dashboard</0> for the company. I was responsible for the frontend using <1>React</1> and <2>Chakra UI</2> and wrote tests using the <3>Playwright</3> testing tool, while my teammates handled the backend. We had regular sync-ups to ensure our components integrated <4>smoothly</4>. This collaboration not only helped us <5>meet our deadlines</5> but also <6>improved</6> the overall quality of the product.
bs: Radio sam na projektu gdje smo morali razviti <0>kompleksnu administracijsku ploču</0> za tvrtku. Bio sam odgovoran za frontend koristeći <1>React</1> i <2>Chakra UI</2> te pisao testove koristeći <3>Playwright</3> alat za testiranje, dok su moji kolege radili na backendu. Redovito smo imali sinkronizacije kako bi osigurali da naši komponente budu integrirane <4>glatko</4>. Ova suradnja nam nije samo pomogla da <5>ispunimo rokove</5>, već je također <6>poboljšala</6> ukupnu kvalitetu proizvoda.

source: I worked on an e-commerce platform where we used <0>React</0>, <1>TypeScript</1>, and <2>Chakra UI</2> for the frontend, <3>Next.js</3> for the backend, <4>MongoDB</4> and <5>Prisma</5> for the database, and <6>Playwright</6> for writing tests. I implemented features like user <7>authentication</7>, <8>product listings</8>, and a <9>checkout page</9>. Using TypeScript, I ensured type safety and reduced bugs. We also used Chakra UI to create a cohesive and responsive design, which made the site very user-friendly.<10/><11/> Additionally, I <12>collaborated</12> closely with backend developers to integrate the frontend with the server-side logic <13>seamlessly</13>, resulting in a smooth and efficient user experience. The project was a great <14>success</14>, improving user engagement and <15>increasing sales</15> for the platform.
bs: Radio sam na e-commerce platformi gdje smo koristili <0>React</0>, <1>TypeScript</1> i <2>Chakra UI</2> za frontend, <3>Next.js</3> za backend, <4>MongoDB</4> i <5>Prisma</5> za bazu podataka, te <6>Playwright</6> za pisanje testova. Implementirao sam značajke poput <7>autentifikacije korisnika</7>, <8>popisa proizvoda</8> i <9>stranice za naplatu</9>. Korištenjem TypeScript-a osigurao sam sigurnost tipova i smanjio greške. Također smo koristili Chakra UI za stvaranje kohezivnog i responzivnog dizajna, što je web stranicu učinilo vrlo user-friendly.<10/><11/> Osim toga, <12>surađivao</12> sam usko s backend developerima kako bi integrirali frontend sa server-side logikom <13>besprijekorno</13>, što je rezultiralo glatkim i učinkovitim korisničkim iskustvom. Projekt je bio veliki <14>uspjeh</14>, poboljšavajući angažman korisnika i <15>povećavajući prodaju</15> na platformi.

source: I'm a web developer.
bs: Ja sam web programer.

source: IIUM, Malaysia
bs: IIUM Malezija

source: In five years, I see myself taking on more <0>leadership responsibilities</0>, possibly <1>leading</1> a development team. I would like to continue honing my <2>technical skills</2> while also <3>mentoring</3> junior developers.<4/><5/> I am also interested in <6>exploring</6> more about system architecture and design, <7>contributing</7> to larger strategic decisions.
bs: Za pet godina sebe vidim kako preuzimam više <0>liderških odgovornosti</0>, moguće <1>vodim</1> razvojni tim. Volio bih nastaviti usavršavati svoje <2>tehničke vještine</2> dok također <3>mentoriram</3> juniorske developere.<4/><5/> Također sam zainteresiran za <6>istraživanje</6> više o sustavnoj arhitekturi i dizajnu, te <7>doprinos</7> većim strateškim odlukama.

source: In one of my projects, we had a major issue, right before a product launch where our application was not scaling properly under load. <0>I led</0> a small team to identify the bottlenecks. <1>We optimized</1> our database queries and <2>introduced</2> caching mechanisms, which significantly <3>improved</3> performance. It was a stressful situation, but it taught me a lot about <4>teamwork</4> and <5>problem-solving</5> under pressure.
bs: U jednom od mojih projekata imali smo veliki problem, neposredno prije lansiranja proizvoda, gdje naša aplikacija nije ispravno skalirala pod opterećenjem. <0>Vodio sam</0> mali tim kako bismo identificirali uska grla. <1>Optimizirali smo</1> naše upite u bazi podataka i <2>uveli</2> mehanizme za keširanje, što je značajno <3>poboljšalo</3> performanse. Bilo je to stresno, ali me naučilo puno o <4>timskom radu</4> i <5>rješavanju problema</5> pod pritiskom.

source: Information and Communication Technology
bs: Informacione i komunikacione tehnologije

source: Innovative Architect
bs: Inovativni Arhitekt

source: Intermediate
bs: Srednji

source: Internship at FLUX - Malaysia
bs: Praksa u FLUX-u - Malezija

source: Internship at IMTM - Maldives
bs: Praksa u IMTM-u - Malezija

source: Invalid email
bs: Neispravna email adresa

source: January 28, 2023
bs: 28. januar 2023.

source: July 28, 2023
bs: 28. juli 2023.

source: Kicked off my academic journey at the International Islamic University Malaysia (IIUM), marking the beginning of my studies.
bs: Započeo sam svoje akademsko putovanje na Međunarodnom islamskom univerzitetu u Maleziji (IIUM), označavajući početak svojih studija.

source: Kuala Lumpur, Malaysia
bs: Kuala Lumpur, Malezija

source: Languages
bs: Jezici

source: Libraries
bs: Biblioteke

source: LifeLine, a Poverty Profiling System, aims to optimize donation distribution using data mining to predict and address needs efficiently. Developed by Ejmen Ramic, the project focuses on reducing unnecessary donations, providing detailed information on needs, and predicting future crises. It targets anyone wishing to combat poverty, leveraging JavaScript and RapidMiner for its web platform. The project’s significance lies in its potential to enhance the impact of donations and raise awareness about global poverty issues.
bs: LifeLine, sistem profiliranja siromaštva, ima za cilj optimizaciju distribucije donacija koristeći rudarenje podataka kako bi se predvidjele i riješile potrebe na efikasan način. Razvijen od strane Ejmena Ramica, projekat se fokusira na smanjenje nepotrebnih donacija, pružajući detaljne informacije o potrebama i predviđajući buduće krize. Cilja svakoga ko želi boriti se protiv siromaštva, koristeći JavaScript i RapidMiner za svoju web platformu. Značaj projekta leži u njegovoj sposobnosti da poboljša uticaj donacija i podigne svijest o globalnim problemima siromaštva.

source: Main Menu
bs: Glavni meni

source: Malaysia, Kuala Lumpur
bs: Malezija, Kuala Lumpur

source: Male, Maldives
bs: Male, Maldivi

source: Message
bs: Poruka

source: Migrated a complex web application from JavaScript and CSS to Typescript and Chakra UI. Not only did we achieve a more modern and user-friendly interface, but we also improved the overall performance of the application by building custom shared components that reused across multiple pages.<0/><1/><2>Tech:</2> React, TypeScript, Chakra UI
bs: Migrirali smo složenu web aplikaciju s JavaScripta i CSS-a na TypeScript i Chakra UI. Ne samo da smo postigli moderniji i korisnički prihvatljiviji sučelje, već smo također poboljšali ukupnu izvedbu aplikacije izradom prilagođenih dijeljenih komponenata koje se koriste na više stranica.<0/><1/><2>Tehnologije:</2> React, TypeScript, Chakra UI

source: Migration to Chakra UI
bs: Migracija na Chakra UI

source: Migration to ShadCn UI
bs: Migracija na ShadCN UI

source: Milestones
bs: Prekretnice

source: My Account
bs: Moj račun

source: My coding style goes beyond just speed. I prioritize writing clean, readable code that ensures responsiveness across all devices.
bs: Moj stil kodiranja nadilazi samo brzinu. Prioritet mi je pisanje čistog, čitljivog koda koji osigurava responzivnost na svim uređajima.

source: My team and I worked on a project where we had to develop a complex admin dashboard for the company. I was responsible for the development of tools that are used by finance, operations marketing team.<0/><1/><2>Tech:</2> React, TypeScript, Chakra UI, Next.js, Prisma, MongoDB,
bs: Moj tim i ja radili smo na projektu gdje smo morali razviti složenu administrativnu ploču za tvrtku. Bio sam odgovoran za razvoj alata koje koriste financijski, operativni i marketinški tim.<0/><1/><2>Tehnologije:</2> React, TypeScript, Chakra UI, Next.js, Prisma, MongoDB,

source: My Website
bs: Moja web stranica

source: Name
bs: Ime

source: Native
bs: Materinski

source: Navigate
bs: Navigacija

source: Need More Information
bs: Potrebne su dodatne informacije

source: Newsletter Subscription
bs: Newsletter Pretplata

source: Not a user?
bs: Niste korisnik?

source: One of my greatest strengths is my ability to <0>learn quickly</0> and <1>adapt</1> to new technologies. For instance, I picked up Chakra UI on my own and have been able to <2>integrate it seamlessly</2> into my projects.<3/><4/> On the flip side, a weakness of mine is that I can be a bit of a <5>perfectionist</5>. Sometimes I spend too much time tweaking small details. I am working on balancing my attention to detail with efficiency.
bs: Jedna od mojih najvećih snaga je sposobnost <0>brzo učiti</0> i <1>prilagoditi</1> se novim tehnologijama. Na primjer, naučio sam Chakra UI samostalno i uspješno ga <2>integrirao</2> u svoje projekte.<3/><4/> S druge strane, moja slabost je što ponekad mogu biti pomalo <5>perfekcionist</5>. Ponekad provedem previše vremena podešavajući male detalje. Radim na tome da uravnotežim svoju pažnju prema detaljima i učinkovitošću.

source: Operative System
bs: Operativni Sistem

source: Password
bs: Lozinka

source: Photographs
bs: Fotografije

source: Photography
bs: Fotografija

source: Photography (dev)
bs: Fotografija (dev)

source: Photography by Ejmen Ramic
bs: Fotografije Ejmena Ramica

source: Please enter a valid email address.
bs: Molimo unesite ispravnu email adresu.

source: Professional Experience
bs: Profesionalno iskustvo

source: Programming
bs: Programiranje

source: Programming Enthusiast. Software & Quality Assurance Engineer.
bs: Entuzijasta za programiranje. Inženjer softvera i osiguranja kvaliteta.

source: Project V4
bs: Projekat V4

source: Projects
bs: Projekti

source: Promoted to the role of Junior Software & QA Engineer, I embraced new challenges and expanded my expertise. Alongside my existing skills in frontend development, I delved into the learning of backend with MongoDB, automated testing with Playwright, and deployment with Vercel server. This journey not only elevated my technical capabilities but also deepened my understanding of software development and quality assurance practices, allowing me to contribute effectively to the team's projects and objectives.
bs: Promovisan u ulogu Junior Softverskog i QA inženjera, prihvatio sam nove izazove i proširio svoju stručnost. Pored postojećih veština u frontend razvoju, uronio sam u učenje backend tehnologija sa MongoDB, automatizovanog testiranja sa Playwright i deploymenta sa Vercel serverom. Ovo putovanje je ne samo unapredilo moje tehničke sposobnosti, već je i produbilo moje razumevanje praksi razvoja softvera i osiguranja kvaliteta, omogućavajući mi da efikasno doprinosim projektima i ciljevima tima.

source: Promotion - Software & QA Engineer - Malaysia
bs: Promocija - Softverski i QA inženjer - Malezija

source: Read More
bs: Pročitaj više

source: Reasons to <0>Count</0> on Me
bs: Razlozi za <0>Računanje</0> na Mene

source: Recommendation from top employers in Malaysia and Bosnia
bs: Preporuka od vodećih poslodavaca u Maleziji i Bosni

source: Recommendation from top employers in USA, Malaysia and Bosnia
bs: Preporuke od vrhunskih poslodavaca iz SAD-a, Malezije i Bosne

source: Register
bs: Registrovati se

source: Registered
bs: Registrovan

source: Remember me
bs: Zapamti me

source: Request Reset
bs: Zatraži reset

source: Resume
bs: Rezime

source: Russian
bs: Ruski

source: School Achievements
bs: Školska dostignuća

source: Seamless Problem-Solver
bs: Besprijekoran rješavač problema

source: Semester 1, 2019/2020
bs: Semestar 1, 2019/2020

source: Semester 1, 2020/2021
bs: Semestar 1, 2020/2021

source: Send Message
bs: Pošalji poruku

source: September 25, 2022
bs: 25. Septembar 2022.

source: Sign in
bs: Prijavi se

source: Sign in to your account
bs: Prijavite se na svoj račun

source: Skills
bs: Vještine

source: So, you want to know how
bs: Dakle, želite da znate kako

source: Software and QA Engineer at FLUX
bs: Softverski i QA inženjer u FLUX-u

source: Source code
bs: Izvorni kod

source: started coding, huh?
bs: sam počeo programirati, ha?

source: Started my studies
bs: Počeo sam studije

source: Stay up to date
bs: Ostanite u toku

source: Stay updated with my latest news and updates! By subscribing, you agree to receive my newsletter.
bs: Ostanite u toku s mojim najnovijim vijestima i ažuriranjima! Pretplatom se slažete s primanjem mog biltena.

source: Subscribing...
bs: Pretplaćivanje...

source: Subscription failed
bs: Pretplata nije uspjela

source: Subscription failed. Please try again.
bs: Pretplata nije uspjela. Molimo pokušajte ponovo.

source: Success!
bs: Uspjeh!

source: Successfully completed my academic journey at the International Islamic University Malaysia (IIUM), earning a degree in Information and Communication Technologies.
bs: Uspješno sam završio svoje akademsko putovanje na Međunarodnom islamskom univerzitetu Malezije (IIUM), stekavši diplomu iz informacionih i komunikacionih tehnologija.

source: Team Collaboration
bs: Timsku Saradnju

source: Technical Expertise
bs: Tehnička Stručnost

source: Technical Skills
bs: Tehničke vještine

source: Thank you for subscribing to my newsletter!
bs: Hvala vam što ste se pretplatili na moj bilten!

source: Thank you for subscribing!
bs: Hvala što ste se pretplatili!

source: The "Blockchain Charity" project is a web application designed to ensure safe and transparent charitable donations via blockchain. It includes smart contract testing for donation and withdrawal transactions, and features for managing and monitoring donations and thresholds. The app uses tools like Truffle, Ganache, and MetaMask to securely handle and display transactions, helping to prevent fraud and money laundering while ensuring funds reach the intended recipients.
bs: Projekt "Blockchain Charity" je web aplikacija dizajnirana za osiguravanje sigurnih i transparentnih dobrotvornih donacija putem blockchaina. Uključuje testiranje pametnih ugovora za transakcije donacija i povlačenja, te značajke za upravljanje i praćenje donacija i pragova. Aplikacija koristi alate poput Truffle-a, Ganache-a i MetaMask-a za sigurno rukovanje i prikazivanje transakcija, pomažući u sprječavanju prevara i pranja novca, osiguravajući da sredstva stignu do namijenjenih primatelja.

source: The following list of frequently asked questions by employers that may also assist you in getting your questions answered:
bs: Sljedeća lista često postavljanih pitanja od strane poslodavaca također vam može pomoći da dobijete odgovore na svoja pitanja:

source: The project board is an exclusive resource for contract work. It's perfect for freelancers, agencies, and moonlighters.
bs: Tabla projekata je ekskluzivni resurs za ugovorni rad. Savršena je za slobodne stručnjake, agencije i povremene radnike.

source: to enjoy all of the cool
bs: da uživate u svim cool

source: Tools
bs: Alati

source: Trustworthy Expert
bs: Pouzdan stručnjak

source: Unable to connect to the subscription service. Please try again later.
bs: Nije moguće povezati se sa servisom za pretplatu. Molimo pokušajte ponovo kasnije.

source: Unable to subscribe. Please try again later.
bs: Nije moguće pretplatiti se. Molimo pokušajte ponovno kasnije.

source: University Graduation
bs: Diplomiranje na univerzitetu

source: Visitors
bs: Posjetitelji

source: We had a data-heavy application that was experiencing slow load times. I <0>optimized</0> the code by implementing lazy loading for components and using <1>React.memo</1> to prevent unnecessary re-renders. On the backend, I optimized our database queries and introduced <2>indexing</2>. These changes <3>improved</3> the application's <4>performance</4> significantly, reducing load times by about <5>40%</5>.
bs: Imali smo aplikaciju koja je radila sa velikim količinama podataka i imala sporo učitavanje. <0>Optimizovao</0> sam kod implementacijom lenjog učitavanja za komponente i korišćenjem <1>React.memo</1> kako bih sprečio nepotrebna ponovna renderovanja. Na backendu sam optimizovao naše upite u bazi podataka i uveo <2>indeksiranje</2>. Ove promene su <3>poboljšale</3> performanse aplikacije, smanjujući vreme učitavanja za oko <5>40%</5>.

source: We wanted more speed and simplicity in our application, so we migrated it from Chakra UI to ShadCn UI. The result was a faster and more responsive application with a clean and modern design. Not only did we drastically reduced the size of our repository but also have simplified and sped up our development workflow by building our own library with ShadCn UI.<0/><1/><2>Tech:</2> ShadCn UI, Tailwind, React, Typescript<3/><4/>
bs: Željeli smo više brzine i jednostavnosti u našoj aplikaciji, pa smo je migrirali s Chakra UI na ShadCn UI. Rezultat je bila brža i responzivnija aplikacija s čistim i modernim dizajnom. Ne samo da smo drastično smanjili veličinu našeg repozitorija, već smo također pojednostavili i ubrzali naš razvojni tijek izradom vlastite biblioteke s ShadCn UI.<0/><1/><2>Tehnologije:</2> ShadCn UI, Tailwind, React, TypeScript<3/><4/>

source: Web Coordinator at International Maldives Travel Market (IMTM)
bs: Web koordinator na Internacionalnom Maldivskom sajmu putovanja (IMTM)

source: Welcome to my website! I am a software engineer and photographer based in Bosnia and Herzegovina. Feel free to view my resume and work. <0/> <1/>Powered by
bs: Dobrodošli na moju web stranicu! Ja sam softverski inženjer i fotograf sa sjedištem u Bosni i Hercegovini. Slobodno pogledajte moj životopis i rad. <0/> <1/>Pokreće

source: What are the website achievements?
bs: Koji su dostignuća web stranice?

source: When it comes to coding swiftly, I aim for efficiency without sacrificing quality.
bs: Kada je riječ o brzom kodiranju, težim ka efikasnosti bez žrtvovanja kvaliteta.

source: When we decided to switch to <0>TypeScript</0> at one of the companies I worked for, I had to get up to speed quickly as I was one of the <1>key developers</1> on the team. I took an online course, read the documentation, and started <2>refactoring</2> small parts of our codebase. Within a <3>few weeks</3>, I was comfortable enough to lead the transition for our entire frontend team.
bs: Kada smo odlučili da pređemo na <0>TypeScript</0> u jednoj od firmi u kojoj sam radio, morao sam brzo da se usavršim jer sam bio jedan od <1>ključnih developera</1> na timu. Pohađao sam online kurs, pročitao dokumentaciju i počeo da <2>refaktorišem</2> male delove našeg koda. Za <3>nekoliko nedelja</3>, bio sam dovoljno siguran da vodim prelazak za ceo naš frontend tim.

source: Working with Ejmen has been a game-changer. His ability to identify, analyze, and resolve issues efficiently is remarkable. Whether it's backend optimization or creating user-friendly interfaces, his contributions consistently elevate the project.
bs: Raditi s Ejmenom je bila velika promjena. Njegova sposobnost da efikasno identifikuje, analizira i rešava probleme je izuzetna. Bilo da je u pitanju optimizacija backend-a ili kreiranje korisnički prijateljskih interfejsa, njegov doprinos dosledno podiže projekat.

source: You have been successfully subscribed to our newsletter.
bs: Uspešno ste se pretplatili na naš bilten.

source: You'll get an email with a reset link
bs: Dobićete email sa linkom za resetovanje

source: Your Email
bs: Vaša email adresa

source: Your email address
bs: Vaša email adresa

source: Your Message
bs: Vaša poruka

source: Your Name
bs: Vaše ime

source: your-email@example.com
bs: vas-email@example.com
